package day13;

public class Day13 {
	public static void main(String[] args) {
		/*
		 * 매서드 오버로딩: 매개변수의 갯수와 자료형에 따라서 각기 다른 매서드가 실행되는 것을 의미
		 * print();
		 * print(1);
		 * print(1,3);
		 * 
		 * 		 
		 *  매서드 오버라이딩: 오버라이딩 하려고 하는 매서드의 이름,매개변수, 리턴값이 모두 같아야한다
		 *  
		 *  
		 *  
		 *  생성자: 객체를 생성할때 자동으로 호출되어 동작하는 일종의 매서드
		 *  클래스명과 동일해야 한다
		 *  리턴이 없고 리턴타입도 없다 
		 *  개발자가 생성자를 하나라도 만들면 기본 생성자는 만들어지지 않는다 
		 *  
		 *  This 키워드: 모든 매서드는 자신이 포함된 클래스 객체를 가리키는 this 참조 변수가 있다
		 *  This 매서드 : 자신이 속한 클래스의 내부의 다른 생성자를 호출한다
		 *  생성자의 내부에서만 사용된다 
		 *  생성자의 첫 줄에서만 사용한다
		 *  이 두개의 규칙중 하나라도 지켜지지 않으면 오류가 발생한다 
		 *  중복되는 코드를 제거할 수 있다 
		 *  
		 */
	}

}
