package day07;

public class Day07_2 {
	public static void main(String[] args) {
		// Package import
		/*
		  패키지는 비슷한 목적으로 생성된 클래스 파일들을 모아둔 폴더를 의미한다
		 1개의 프로젝트에 1개 또는 여러개의 패키지를 생성할 수 있다
		  패캐지를 아예 생성하지 않아도 전혀 문제는 없지만 패키지 사용을 권장한다
		  패키지를 생성하면 클래스를 만들때 첫번째 줄에 반드시 'package 패키지명;'이 반드시 명시되야 한다 
		  패키지 사용의 장점:
		 1. 패키지의 영향으로 클래스가 저장되는 공간이 분리되어 클래스 명의 충돌을 방지할 수 있다.
		 
		 import는 다른 패키지내의 클래스를 사용하기 위한 목적인 문법이다.
		  코드 상에서는 패키지 선언 다음줄에 위치한다 
		  일반적으로 자바가 동작할 대는 자신이 속한 패키지 내부에 위치한 클래스만을 사용할 수 있다.
		  다른 패키지에 있는 클래스를 사용하는 방법은 2가지가 있다.
		 1. 클래스의 fullname을 사용하는 방법. '패키지명.클래스명'
		 2. 같은 패키지 내의 타 클래스 사용법  A a = new A();
		 3. 다른 패키지 내의 타 클래스 사용법 am.a a = new am.A(); 패키지명까지 붙여준다 
		 4. 다른 패키지의 클래스를 사용하려면 그 클래스는 접근제어자로 public이 선언되어 있어야만 함 
		 
//		day07.A a=new day07.A();
//		a.print();
	
		
		
		*/
		
	}

}
